[{
  "title": "美しい機能たち",
  "body": "私たちはこれまで、機能にコストが見合っていない、機能優先のプロダクトデザインを数多く見てきた。\nある機能が利用者にとってマイナスの価値を生む場合というのもあり得るのだ。\nなぜなら、それを理解し、使うのが困難な場合があるからである。\n人々が好むのは、ただきちんと動く製品であることを、私たちは理解している。\nそれはつまり、ただきちんと動くものをデザインするのは、長い機能リストを持った製品を作るよりも難しいということだ。\n\n機能を追加する際には、その仕様を決めるコスト、デザインするコスト、そして開発するコストが発生する。\nさらにそれをテストするコスト、信頼性を高めるコストも発生する。\nそして機能が多ければ多いほど、それらが問題を引き起こしたり、ほかに悪影響を与えたりする可能性が高くなる。\n\n機能を追加すると、ドキュメントを書くコストも発生する。\nすべての機能は、マニュアルのページ数を増加させ、習得までの時間を長くしてしまう。\nごく一部のユーザーだけに意味のある機能であっても、それらのコスト上昇はすべてのユーザーに影響する。\nしたがって、製品やプログラム言語をデザインする際には、私たちは中心となる機能、つまり「良いパーツ」を正しく選び出す必要がある。\nなぜならそれが、最も価値を生むやりかただからだ。\n\n私たちはみな、自分が使っている製品の「良いパーツ」を見つけることができる。\n私たちはシンプルさを評価する。\nそしてシンプルなものが提供されない場合は、それを自分たちで作るのだ。\n\nもし、プロダクトやプログラミング言語が「良いパーツ」だけを持つようにデザインされたとしたら、それはきっとすばらしいことだろう。",
  "note": "Douglas Crockford 著 「JavaScript The Good Parts」より"
}, {
  "title": "知的な誠実さ",
  "body": "確固たる信念をもって知的な誠実さを養うことも、プログラミングのプロとして成長することの一部である。知的な誠実さはいくつかの形で表れる。\n\n・専門家でないのに専門家のふりをしない。\n・自分の過ちを素直に認める。\n・コンパイラの警告メッセージを出ないようにするのではなく、それを理解することに努める。\n・プログラムのコンパイルが通るかどうかを確かめるのではなく、プログラムをきちんと理解する。\n・現状どおりの進捗を報告する。\n・現実的なスケジュールを見積り、経営陣がスケジュールの調整を求めてきても一歩も引かない。\n\n誤りを認めなければ、Sallyは自分をごまかしているだけである。他のだれもが、誠実ではない高慢なプログラマと働いていることを知るだろう。これは、ちょっとしたミスを犯すのとはわけが違う、取り返しのつかない誤りである。ミスを犯したら、すぐに潔く認めよう。\n\n経営陣には、会社を経営するという全体的な責任がある。もしもあなたが、そのプロジェクトがすばらしい、会社にとって重要な新しい分野を開拓できる、あるいはトレーニングとして価値があると考えているなら、それを言うべきである。経営陣はそうした要因も考慮するだろう。だが、経営陣をだまして判断を誤らせれば、会社は文字どおり数十万ドルの損失を被るおそれがある。それで失業したとしても、それは自業自得である。",
  "note": "スティーブ・マコネル　「コード・コンプリート（下）」　第7章　ソフトウェア職人気質とは　より抜粋"
}, {
  "title": "人は誰の奴隷でもない",
  "body": "他者に頭を下げさせて、それで己の地位を確認しなければ安心できない者、そんな者の矜持など知ったことではない。\nそれよりも、人に頭を下げるたび、壊れているもののほうが問題だと、わたしは思う。\n礼とは心の中にあるものを表すためのもので、形によって心を量るためのものではないだろう。\n人は誰の奴隷でもない。そんなことのために生まれるのじゃない。\n他者に虐げられても屈することのない心、災厄に襲われても挫けることのない心、不正があれば正すことを恐れず、豺虎に媚びず、己という領土を治める唯一無二の君主に。\nそのためにはまず、他者の前で毅然と首を上げることから始めて欲しい。",
  "note": "十二国記「風の万里　黎明の空」"
}, {
  "title": "Ｃ・ウェイン・ラトリフさんへのインタビューより",
  "body": "その頃の私はコンピュータそのものでした。\n肩書きはコンピュータだったんです。\n他の人たちはコンピュータのプログラムを書くわけですね。\nところが私はコンピュータだったんです。\n",
  "note": "実録!天才プログラマー (マイクロソフトプレスシリーズ}"
}, {
  "title": "ピーター・ロイゼンさんへのインタビューより",
  "body": "私にとって、仕事とは税金のようなものなんです。\n税金は、喜んで払います。社会に対する義務ですからね。\nそれに、もし社会が消滅したら、金を稼げなくなりますからね。\n\n私の知人で、税金のことをくよくよと心配して時間を無駄にしている人がいます。\nそんな暇があったら、金をしこたま稼げばいいと思うんですけどね。",
  "note": "実録!天才プログラマー (マイクロソフトプレスシリーズ}"
}, {
  "title": "銀の弾とソフトウェアプロジェクト",
  "body": "民話の中の悪夢に登場する怪物のうちでも狼人間ほど恐ろしいものはない。\nというのも、狼人間は慣れ親しんでいるものを不意に恐怖に変えてしまうからだ。\nだから、私たちはこの狼人間を魔法のように鎮めることができる銀の弾を探し求める。\n\n慣れ親しんだソフトウェアプロジェクトにもこうした性質が若干あり（少なくとも非技術担当マネージャーの目から見ると）、ふだんは無害でまともなのだが、スケジュールの遅延、膨れ上がった予算、そして欠陥製品といった怪物にもなり得る。\nそして私たちは銀の弾、すなわちコンピュータハードウェアのコストと同じようにソフトウェアのコストも急激に小さくしてくれる特効薬を求める必死の叫び声を聞くのである。\n\nしかし、これから十年間という範囲で眺めると、銀の弾などはどこにも見えない。技術においても、管理手法においても、それだけで十年間に生産性や信頼性と容易性での飛躍的な改善を一つでも約束できるような開発は一つとしてない。\n本章では、ソフトウェア問題の本質と、提案されているそれぞれの銀の弾の特性の両方を検証することによって、それがなぜ特効薬になりえないのかについて見ていくことにする。\n\nとはいっても、懐疑主義は悲観主義とは違う。\n輝かしい進展は見えないが、実際のところそう決めてかかることはソフトウェアの本質からは離れている。\n多くの頼もしい新機軸 (革新} が着々と進められている。それらを開発、普及、利用するという苦しいが一貫した努力こそ、飛躍的な改善をもたらすはずだ。\n王道はない。しかし、道はある。\n\n病気治療の第一ステップは、悪魔信仰を細菌説によって生理学的理論に置き換えることだった。\nそのステップこそ希望の始まりであり、すべての魔法のような解決の夢を打ち砕いた。\n医療従事者は、進歩は段階を追いながら多大な労力を払って遂げるもので、健康回復には持続的で根気強い看護がなされなければならないと教え込まれた。\n今日のソフトウェアエンジニアリングにおいても、それは変わらない。<br>",
  "note": "— ブルックス、滝沢、牧野、宮澤、2002年、第16章、pp.166-167"
}, {
  "title": "計画に従うことよりも変化への対応を",
  "body": "私たちは、ソフトウェア開発の実践、あるいは実践の手助けをする活動を通じて、よりよい開発方法を見つけだそうとしている。\nこの活動を通じて、私たちは以下の価値に至った。\n\nプロセスやツールよりも<strong>個人と対話</strong>を、\n包括的なドキュメントよりも<strong>動くソフトウェア</strong>を、\n契約交渉よりも<strong>顧客との協調</strong>を、\n計画に従うことよりも<strong>変化への対応</strong>を、\n価値とする。\nすなわち、左記のことがらに価値があることを認めながらも、\n私たちは右記のことがらにより価値をおく。",
  "note": "アジャイルソフトウェア開発宣言より"
}, {
  "title": "口で語るな手で語れ",
  "body": "手の裏付けのない言葉はあまりに安い。人を動かしたかったら、まず自分の手を動かせ。手が塞がっていたら、手を動かした経験を語れ。口で語るな手で語れ。",
  "note": "404 Blog Not Found - スーツの道も、舗装するのはギーク"
}, {
  "title": "徹底的に体験しよう",
  "body": "勉強して本を読むだけで賢くなれはしない。さまざまな体験をすることによって人は賢くなる。\nもちろん、すべての体験が安全だというわけではない。体験することは、危険である。\nひどい場合には、その体験の中毒や依存症になってしまうからだ。\nそして、体験しているときはその事柄に没頭することが肝要だ。\n途中で自分の体験について冷静に観察するのはよくない。そうでないと、しっかりと体験したことにはならないからだ。\n反省だの観察たのといったことは、体験のあとでなされるべきだ。\nそこからようやく智慧というものが生まれてくるのだから。",
  "note": "フリードリヒ・ニーチェ"
}]
